app/Models/AuthorModel.php

    public function getAuthors($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `Authors`