app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = '1dorohov1@gmail.com'
 LIMIT 1
---
    public function isExist($email, $userPassword)
    {
        $user = $this->where("email", $email)->first();